async def mentor_start() -> list[str]:
    """
    Should provide a starting point with a ReplyMarkupKeyboard
    It should contain all the following handles

    Parameters
    ----------
    message : telebot.types.Message
        A pyTelegramBotAPI Message type class

    Returns
    -------
    iterable
        Iterable with all handles texts
    """
    return ['Запросы', 'Мои направления', 'Мои студенты', 'Пет-проект', 'Поддержка']


async def mentor_help() -> str:
    return 'Привет! Я здесь для того, чтобы помочь тебе поддерживать связь со ' \
           'студентами, нуждающимися в твоих советах. Прочитай это сообщение ' \
           'внимательно, ведь это важно! Мой функционал:\n\n' \
           '- Каждый раз, когда студент добавляет запрос по твоему направлению, тебе ' \
           'будет приходить сообщение.\n' \
           '- Кнопка «Запросы» вернет список «висящих» запросов от студентов.\n' \
           '- Нажимая на кнопку «Мои направления», ты можешь увидеть список направлений, по ' \
           'которым ты ведешь менторство. Там же ты можешь удалить или добавить ' \
           'направление. Если ты хочешь добавить направление, которого нет в списке ' \
           'доступных, напиши в поддержку.\n' \
           '- «Мои студенты» вернет тебе список твоих студентов с названием их работ.\n' \
           '- Кнопка «Поддержка» нужна для связи со службой поддержки. Обращайся, если ' \
           'у тебя возникли вопросы по функционалу, темам, направлениям или студентам.'
