async def generic_start() -> list[str]:
    """
    Should provide a starting point with a ReplyMarkupKeyboard
    It should contain all the following handles

    Parameters
    ----------
    message : telebot.types.Message
        A pyTelegramBotAPI Message type class

    Returns
    -------
    iterable
        Iterable with all handles texts
    """
    commands = ['Добавить запрос', 'Удалить запрос', 'Мои запросы', 'Идеи',
                'Поддержка']
    return commands


async def student_help() -> str:
    return 'Привет! Я здесь для того, чтобы помочь тебе найти ментора, если тебе нужна ' \
           'помощь с твоей курсовой. Прочитай это сообщение внимательно, ведь это важно! ' \
           'Мой функционал:\n' \
           '- Кнопка «Добавить запрос» позволяет запросить ментора. При нажатии она ' \
           'вернет список направлений, по которым ведется менторство. Если подходящего ' \
           'направления там нет, обращайся в поддержку, мы поможем! Если же ты нашел ' \
           'свое направление, выбирай его и пиши свою тему. Если ты еще не определился, ' \
           'какую именно курсовую хочешь написать, то можешь отправить несколько ' \
           'запросов, однако, как только один из них примет ментор, остальные ' \
           'аннулируются.\n\n' \
           'Также эта кнопка позволит тебе добавить дополнительный запрос после ' \
           'принятия твоей курсовой ментором в том случае, если у работы несколько ' \
           'направлений.\n' \
           '- Кнопка «Удалить запрос» вернет тебе список с твоими запросами, нажав на ' \
           'которые, ты можешь их удалить. Если же ты уже работаешь с ментором, то эта ' \
           'кнопка предложить удалить твою курсовую: это нужно для завершения работы ' \
           'после окончания курсовой.\n' \
           '- Кнопка «Мои запросы» вернет список твоих текущих запросов.\n' \
           '- При нажатии на «Хочу стать ментором», сообщение отправится ' \
           'администратору, после чего с тобой свяжутся.\n' \
           '- Кнопка «Поддержка» нужна для связи со службой поддержки. Обращайся, если ' \
           'у тебя возникли вопросы по функционалу, темам, направлениям или менторам.'
